In [1]:
from MySQLdb import connect
import pandas as pd

In [2]:
# Connect to your MySQLdb
conn = connect(host='localhost', user='root')

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [4]:
# Execute a query
cur.execute("SELECT version();")

1

In [5]:
# Retrieve query results
records = cur.fetchall()

In [6]:
records

(('8.2.0',),)

In [7]:
# Execute a query
cur.execute('''SELECT * FROM sqlw3s.Customers;''')

91

In [8]:
# Retrieve query results
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]

In [9]:
df

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,05021,Mexico
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,05023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden
...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland

In [10]:
# Execute a query
cur.execute('''SELECT CustomerName, City FROM sqlw3s.Customers;''')

91

In [11]:
# Retrieve query results
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]

In [12]:
df

                          CustomerName         City
0                  Alfreds Futterkiste       Berlin
1   Ana Trujillo Emparedados y helados  México D.F.
2              Antonio Moreno Taquería  México D.F.
3                      Around the Horn       London
4                   Berglunds snabbköp        Luleå
..                                 ...          ...
86                      Wartian Herkku         Oulu
87              Wellington Importadora      Resende
88                White Clover Markets      Seattle
89                         Wilman Kala     Helsinki
90                              Wolski        Walla

[91 rows x 2 columns]

In [13]:
# Execute a query
cur.execute('''SELECT DISTINCT Country FROM sqlw3s.Customers;''')

21

In [14]:
# Retrieve query results
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]

In [15]:
df

        Country
0       Germany
1        Mexico
2            UK
3        Sweden
4        France
5         Spain
6        Canada
7     Argentina
8   Switzerland
9        Brazil
10      Austria
11        Italy
12     Portugal
13          USA
14    Venezuela
15      Ireland
16      Belgium
17       Norway
18      Denmark
19      Finland
20       Poland